; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depotprob134536825) (:domain depots)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate9)
	(at pallet1 depot1)
	(clear crate5)
	(at pallet2 depot2)
	(clear crate3)
	(at pallet3 distributor0)
	(clear crate6)
	(at pallet4 distributor1)
	(clear crate8)
	(at pallet5 distributor2)
	(clear crate7)
	(at truck0 distributor1)
	(at truck1 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 distributor2)
	(on crate1 pallet5)
	(at crate2 depot2)
	(on crate2 pallet2)
	(at crate3 depot2)
	(on crate3 crate2)
	(at crate4 distributor1)
	(on crate4 pallet4)
	(at crate5 depot1)
	(on crate5 pallet1)
	(at crate6 distributor0)
	(on crate6 pallet3)
	(at crate7 distributor2)
	(on crate7 crate1)
	(at crate8 distributor1)
	(on crate8 crate4)
	(at crate9 depot0)
	(on crate9 crate0)
)

(:goal (and
		(on crate1 pallet5)
		(on crate2 crate3)
		(on crate3 pallet3)
		(on crate4 pallet4)
		(on crate5 crate4)
		(on crate7 crate5)
		(on crate8 crate7)
		(on crate9 crate1)
	)
))

; plan
1. (lift hoist4 crate8 crate4 distributor1)
   deleted: (at crate8 distributor1) (available hoist4) (on crate8 crate4) (clear crate8)
   added: (lifting hoist4 crate8) (clear crate4)
   goals met: 2 of 8
2. (load hoist4 crate8 truck1 distributor1)
   deleted: (lifting hoist4 crate8)
   added: (in crate8 truck1) (available hoist4)
   goals met: 2 of 8
3. (lift hoist2 crate3 crate2 depot2)
   deleted: (at crate3 depot2) (available hoist2) (on crate3 crate2) (clear crate3)
   added: (lifting hoist2 crate3) (clear crate2)
   goals met: 2 of 8
4. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 2 of 8
5. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 2 of 8
6. (unload hoist5 crate8 truck1 distributor2)
   deleted: (available hoist5) (in crate8 truck1)
   added: (lifting hoist5 crate8)
   goals met: 2 of 8
7. (lift hoist0 crate9 crate0 depot0)
   deleted: (at crate9 depot0) (available hoist0) (on crate9 crate0) (clear crate9)
   added: (lifting hoist0 crate9) (clear crate0)
   goals met: 2 of 8
8. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 2 of 8
9. (load hoist0 crate9 truck1 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck1) (available hoist0)
   goals met: 2 of 8
10. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 2 of 8
11. (lift hoist1 crate5 pallet1 depot1)
   deleted: (at crate5 depot1) (available hoist1) (on crate5 pallet1) (clear crate5)
   added: (lifting hoist1 crate5) (clear pallet1)
   goals met: 2 of 8
12. (load hoist1 crate5 truck1 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   goals met: 2 of 8
13. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 2 of 8
14. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 2 of 8
15. (unload hoist4 crate5 truck1 distributor1)
   deleted: (available hoist4) (in crate5 truck1)
   added: (lifting hoist4 crate5)
   goals met: 2 of 8
16. (drop hoist4 crate5 crate4 distributor1)
   deleted: (lifting hoist4 crate5) (clear crate4)
   added: (at crate5 distributor1) (available hoist4) (on crate5 crate4) (clear crate5)
   goals met: 3 of 8
17. (lift hoist3 crate6 pallet3 distributor0)
   deleted: (at crate6 distributor0) (available hoist3) (on crate6 pallet3) (clear crate6)
   added: (lifting hoist3 crate6) (clear pallet3)
   goals met: 3 of 8
18. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 3 of 8
19. (load hoist2 crate3 truck1 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   goals met: 3 of 8
20. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 3 of 8
21. (drop hoist3 crate6 pallet3 distributor0)
   deleted: (lifting hoist3 crate6) (clear pallet3)
   added: (at crate6 distributor0) (available hoist3) (on crate6 pallet3) (clear crate6)
   goals met: 3 of 8
22. (unload hoist3 crate3 truck1 distributor0)
   deleted: (available hoist3) (in crate3 truck1)
   added: (lifting hoist3 crate3)
   goals met: 3 of 8
23. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 3 of 8
24. (load hoist3 crate3 truck0 distributor0)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck0) (available hoist3)
   goals met: 3 of 8
25. (lift hoist3 crate6 pallet3 distributor0)
   deleted: (at crate6 distributor0) (available hoist3) (on crate6 pallet3) (clear crate6)
   added: (lifting hoist3 crate6) (clear pallet3)
   goals met: 3 of 8
26. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 3 of 8
27. (unload hoist2 crate3 truck0 depot2)
   deleted: (available hoist2) (in crate3 truck0)
   added: (lifting hoist2 crate3)
   goals met: 3 of 8
28. (drop hoist3 crate6 pallet3 distributor0)
   deleted: (lifting hoist3 crate6) (clear pallet3)
   added: (at crate6 distributor0) (available hoist3) (on crate6 pallet3) (clear crate6)
   goals met: 3 of 8
29. (load hoist2 crate3 truck1 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   goals met: 3 of 8
30. (lift hoist3 crate6 pallet3 distributor0)
   deleted: (at crate6 distributor0) (available hoist3) (on crate6 pallet3) (clear crate6)
   added: (lifting hoist3 crate6) (clear pallet3)
   goals met: 3 of 8
31. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 3 of 8
32. (unload hoist4 crate3 truck1 distributor1)
   deleted: (available hoist4) (in crate3 truck1)
   added: (lifting hoist4 crate3)
   goals met: 3 of 8
33. (lift hoist2 crate2 pallet2 depot2)
   deleted: (at crate2 depot2) (available hoist2) (on crate2 pallet2) (clear crate2)
   added: (lifting hoist2 crate2) (clear pallet2)
   goals met: 3 of 8
34. (load hoist2 crate2 truck0 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   goals met: 3 of 8
35. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 3 of 8
36. (load hoist4 crate3 truck0 distributor1)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck0) (available hoist4)
   goals met: 3 of 8
37. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 3 of 8
38. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 3 of 8
39. (unload hoist2 crate3 truck0 depot2)
   deleted: (available hoist2) (in crate3 truck0)
   added: (lifting hoist2 crate3)
   goals met: 3 of 8
40. (drop hoist2 crate3 pallet2 depot2)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (at crate3 depot2) (available hoist2) (on crate3 pallet2) (clear crate3)
   goals met: 3 of 8
41. (unload hoist2 crate2 truck0 depot2)
   deleted: (available hoist2) (in crate2 truck0)
   added: (lifting hoist2 crate2)
   goals met: 3 of 8
42. (drop hoist2 crate2 crate3 depot2)
   deleted: (lifting hoist2 crate2) (clear crate3)
   added: (at crate2 depot2) (available hoist2) (on crate2 crate3) (clear crate2)
   goals met: 4 of 8
43. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 4 of 8
44. (load hoist5 crate8 truck1 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck1) (available hoist5)
   goals met: 4 of 8
45. (lift hoist5 crate7 crate1 distributor2)
   deleted: (at crate7 distributor2) (available hoist5) (on crate7 crate1) (clear crate7)
   added: (lifting hoist5 crate7) (clear crate1)
   goals met: 4 of 8
46. (load hoist5 crate7 truck1 distributor2)
   deleted: (lifting hoist5 crate7)
   added: (in crate7 truck1) (available hoist5)
   goals met: 4 of 8
47. (unload hoist5 crate9 truck1 distributor2)
   deleted: (available hoist5) (in crate9 truck1)
   added: (lifting hoist5 crate9)
   goals met: 4 of 8
48. (drop hoist5 crate9 crate1 distributor2)
   deleted: (lifting hoist5 crate9) (clear crate1)
   added: (at crate9 distributor2) (available hoist5) (on crate9 crate1) (clear crate9)
   goals met: 5 of 8
49. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 5 of 8
50. (unload hoist4 crate7 truck1 distributor1)
   deleted: (available hoist4) (in crate7 truck1)
   added: (lifting hoist4 crate7)
   goals met: 5 of 8
51. (drop hoist4 crate7 crate5 distributor1)
   deleted: (lifting hoist4 crate7) (clear crate5)
   added: (at crate7 distributor1) (available hoist4) (on crate7 crate5) (clear crate7)
   goals met: 6 of 8
52. (unload hoist4 crate8 truck1 distributor1)
   deleted: (available hoist4) (in crate8 truck1)
   added: (lifting hoist4 crate8)
   goals met: 6 of 8
53. (drop hoist4 crate8 crate7 distributor1)
   deleted: (lifting hoist4 crate8) (clear crate7)
   added: (at crate8 distributor1) (available hoist4) (on crate8 crate7) (clear crate8)
   goals met: 7 of 8
54. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 7 of 8
55. (load hoist3 crate6 truck0 distributor0)
   deleted: (lifting hoist3 crate6)
   added: (in crate6 truck0) (available hoist3)
   goals met: 7 of 8
56. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 7 of 8
57. (lift hoist2 crate2 crate3 depot2)
   deleted: (at crate2 depot2) (available hoist2) (on crate2 crate3) (clear crate2)
   added: (lifting hoist2 crate2) (clear crate3)
   goals met: 6 of 8
58. (load hoist2 crate2 truck0 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   goals met: 6 of 8
59. (lift hoist2 crate3 pallet2 depot2)
   deleted: (at crate3 depot2) (available hoist2) (on crate3 pallet2) (clear crate3)
   added: (lifting hoist2 crate3) (clear pallet2)
   goals met: 6 of 8
60. (load hoist2 crate3 truck0 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   goals met: 6 of 8
61. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 6 of 8
62. (unload hoist3 crate3 truck0 distributor0)
   deleted: (available hoist3) (in crate3 truck0)
   added: (lifting hoist3 crate3)
   goals met: 6 of 8
63. (drop hoist3 crate3 pallet3 distributor0)
   deleted: (lifting hoist3 crate3) (clear pallet3)
   added: (at crate3 distributor0) (available hoist3) (on crate3 pallet3) (clear crate3)
   goals met: 7 of 8
64. (unload hoist3 crate2 truck0 distributor0)
   deleted: (available hoist3) (in crate2 truck0)
   added: (lifting hoist3 crate2)
   goals met: 7 of 8
65. (drop hoist3 crate2 crate3 distributor0)
   deleted: (lifting hoist3 crate2) (clear crate3)
   added: (at crate2 distributor0) (available hoist3) (on crate2 crate3) (clear crate2)
   goals met: 8 of 8
